models/AppRoleUser.php

    public static function findIdentity($id)
    {
        return static::findOne(['userid'=>$id]);
---
SELECT * FROM `app_role_user` WHERE `userid`=1